Merge pull request #6 from agritheory/ha_sync
Ha sync
